app/views/admin_panel/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
                <tr>
                  <td><%= booking.user.firstname %></td>