app/views/root/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
                  <p><%= comment.content %></p>
                  <h5><%= comment.user.firstname+" "+comment.user.lastname %></h5>