app/controllers/admin_panel_controller.rb

SELECT "users".* FROM "users"
SELECT "rooms".* FROM "rooms"
---
  def index
    if(user_signed_in?)
      if(current_user.role.id==0)
        @users=User.all
        @rooms = Room.all