app/controllers/admin_panel_controller.rb

SELECT "hotels".* FROM "hotels"
---
  def index
    if(user_signed_in?)
      if(current_user.role.id==0)
        @users=User.all
        @hotels=Hotel.all