app/controllers/hotels_controller.rb

  def create
    rand_hex = SecureRandom.hex(10)
    pimage = params[:hotel][:hotel_pic]
    if(pimage==nil)
      flash[:notice]= "Please attach your profile picture"
      redirect_to new_hotel_path
      return
    end
    puts pimage.original_filename
    @uploadedFile=pimage
    cl_response = Cloudinary::Uploader.upload(@uploadedFile.tempfile, :public_id => rand_hex)
    if(cl_response['secure_url']==nil)
      flash[:notice]= "There is a server side problem. Please try again later"
      redirect_to new_hotel_path
      return
    end
    params[:hotel][:hotel_pic_path]=cl_response['secure_url']
    puts "\n\n\n"
    puts params.inspect

    @hotel = Hotel.new(hotel_params)
    respond_to do |format|
      if @hotel.save
---
INSERT INTO "hotels" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-04-20 19:36:29.390899"], ["updated_at", "2018-04-20 19:36:29.390899"]]

  def update_picture
    puts "\n\nUpdating picture"
    puts params.inspect
    puts "\n\n\n"
    if(current_user==nil || current_user.role.id!=0)
      flash[:notice]= "You must be an admin to change a hotel picture"
      redirect_to edit_hotel_path(@hotel)
      return
    end
    rand_hex = SecureRandom.hex(10)
    pimage = params[:hotel_pic]
    if(pimage!=nil)
      puts pimage.original_filename
      @uploadedFile=pimage
      cl_response = Cloudinary::Uploader.upload(@uploadedFile.tempfile, :public_id => rand_hex)
      if(cl_response['secure_url']==nil)
        flash[:notice]= "There is a server side problem. Please try again later"
        redirect_to edit_hotel_path(@hotel)
        return
      end
      @hotel.update(hotel_pic_path: cl_response['secure_url'])
---
UPDATE "hotels" SET "hotel_pic_path" = ?, "updated_at" = ? WHERE "hotels"."id" = ?  [["hotel_pic_path", "https://res.cloudinary.com/shareasnap/image/upload/v1524410855/577857feaf6e04b7dbcb.jpg"], ["updated_at", "2018-04-22 15:27:37.935809"], ["id", 1]]

    def set_hotel
      @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]