app/controllers/rooms_controller.rb

  def new
    @room = Room.new
    @categories = RoomCategory.all
---
SELECT "room_categories".* FROM "room_categories"

  def edit
    @categories=RoomCategory.all
---
SELECT "room_categories".* FROM "room_categories"

  def create
    rand_hex = SecureRandom.hex(10)
    pimage = params[:room][:room_pic]
    if(pimage==nil)
      flash[:notice]= "Please attach the room picture"
      redirect_to new_room_path
      return
    end
    puts pimage.original_filename
    @uploadedFile=pimage
    cl_response = Cloudinary::Uploader.upload(@uploadedFile.tempfile, :public_id => rand_hex)
    if(cl_response['secure_url']==nil)
      flash[:notice]= "There is a server side problem. Please try again later"
      redirect_to new_room_path
      return
    end
    params[:room][:room_pic_path]=cl_response['secure_url']
    params[:room][:isAvailable]=true
    params[:room][:rating]=0
    puts "\n\n\n"
    puts params.inspect
    @room = Room.new(room_params)
    cat = RoomCategory.find_by_id(room_params[:room_category_id])
    @room.room_category=cat
    puts "\n\n\nRoom Object\n"
    puts @room.inspect
    puts "\n\n\n-----------Room Object\n"
    puts "\n\n\n-----------Room Object\n"
    respond_to do |format|
      if @room.save
---
SELECT  "room_categories".* FROM "room_categories" WHERE "room_categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "rooms" ("number", "isAvailable", "description", "room_category_id", "price", "user_id", "rating", "room_pic_path", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

        format.json { render :show, status: :created, location: @room }
      else
        @room = Room.new
        @categories = RoomCategory.all
---
SELECT "room_categories".* FROM "room_categories"

  def destroy
    @room.destroy
---
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 1]]

  def update_picture
    puts "\n\nUpdating picture"
    puts params.inspect
    puts "\n\n\n"
    if(current_user==nil || current_user.role.id!=0)
      flash[:notice]= "You must be an admin to change a room's picture"
      redirect_to edit_room_path(@room)
      return
    end
    rand_hex = SecureRandom.hex(10)
    pimage = params[:room_pic]
    if(pimage!=nil)
      puts pimage.original_filename
      @uploadedFile=pimage
      cl_response = Cloudinary::Uploader.upload(@uploadedFile.tempfile, :public_id => rand_hex)
      if(cl_response['secure_url']==nil)
        flash[:notice]= "There is a server side problem. Please try again later"
        redirect_to edit_room_path(@room)
        return
      end
      @room.update(room_pic_path: cl_response['secure_url'])
---
UPDATE "rooms" SET "room_pic_path" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["room_pic_path", "https://res.cloudinary.com/shareasnap/image/upload/v1524449456/263935ab02e82e59e0a0.jpg"], ["updated_at", "2018-04-23 02:10:57.577771"], ["id", 2]]