app/controllers/users/registrations_controller.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create

    rand_hex = SecureRandom.hex(10)
    pimage = params[:user][:profile_pic]
    if(pimage==nil)
      flash[:notice]= "Please attach your profile picture"
      redirect_to new_user_registration_path
      return
    end
    puts pimage.original_filename
    @uploadedFile=pimage
    cl_response = Cloudinary::Uploader.upload(@uploadedFile.tempfile, :public_id => rand_hex)
    if(cl_response['secure_url']==nil)
      flash[:notice]= "There is a server side problem. Please try again later"
      redirect_to new_user_registration_path
      return
    end
    params[:user][:profile_pic]=cl_response['secure_url']
    if(User.all.count==0)
      params[:user][:role_id]= Role.find(0).id; # make first user the admin

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if(!user_signed_in?)
      redirect_to new_user_session_path, root_path
    elsif(current_user.role.id!=0 && current_user.id!=(params[:format]).to_i)
       redirect_to root_path
    end
    @user = User.find_by_id(params[:format])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    if(!user_signed_in?)
      redirect_to new_user_session_path, root_path
    elsif(current_user.role.id!=0 && current_user.id!=(params[:format]).to_i)
      redirect_to root_path
    end
    @user = User.find_by_id(params[:format])
    Comment.all.each do |comment|
      puts "\n\n\nchecking comment #{comment.id}"
      if(comment.user.id == @user.id)
        comment.destroy

UPDATE "users" SET "profile_pic" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_pic", "https://res.cloudinary.com/shareasnap/image/upload/v1520998196/c6f46e411f8639c26352.jpg"], ["updated_at", "2018-03-14 03:29:58.118339"], ["id", 2]]
---
  def update_picture
    puts "\n\nUpdating picture"
    puts params.inspect
    puts "\n\n\n"
    if(current_user==nil)
      redirect_to edit_user_registration_path
      return
    end
    rand_hex = SecureRandom.hex(10)
    pimage = params[:profile_pic]
    if(pimage!=nil)
      puts pimage.original_filename
      @uploadedFile=pimage
      cl_response = Cloudinary::Uploader.upload(@uploadedFile.tempfile, :public_id => rand_hex)
      if(cl_response['secure_url']==nil)
        flash[:notice]= "There is a server side problem. Please try again later"
        redirect_to edit_user_registration_path
        return
      end
      current_user.update(profile_pic: cl_response['secure_url'])